tap 'homebrew/cask-fonts'

# Core Homebrew
brew 'freetype'
brew 'fzf'
brew 'git'
brew 'grep'
brew 'imagemagick'
brew 'jpeg'
brew 'kubernetes-cli'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'mas'
brew 'minio/stable/mc'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'jenv'
brew 'oniguruma'
brew 'openssl'
brew 'pcre'
brew 'sqlite'
brew 'tig'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'zsh'

# Cask Apps
cask_args appdir: '/Applications'

cask 'docker'
cask 'discord'
cask 'firefox'
cask 'font-open-sans'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'gitup'
cask 'google-chrome'
cask 'lulu'
cask 'notion'
cask 'obs'
cask 'orbstack'
cask 'rectangle'
cask 'spotify'
cask 'slack'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Amphetamine', id: 937984704
